/*
 Navicat Premium Data Transfer

 Source Server         : qianli
 Source Server Type    : MySQL
 Source Server Version : 80027
 Source Host           : localhost:3306
 Source Schema         : qianli

 Target Server Type    : MySQL
 Target Server Version : 80027
 File Encoding         : 65001

 Date: 03/11/2023 16:24:41
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for qianli_product
-- ----------------------------
DROP TABLE IF EXISTS `qianli_product`;
CREATE TABLE `qianli_product` (
  `id` int NOT NULL AUTO_INCREMENT,
  `category_id` int NOT NULL COMMENT '产品分类',
  `title` varchar(255) NOT NULL COMMENT '产品标题',
  `name` varchar(255) NOT NULL COMMENT '产品名称',
  `detail` varchar(2000) NOT NULL COMMENT '产品介绍',
  `media` varchar(255) DEFAULT NULL COMMENT '产品视频',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- ----------------------------
-- Records of qianli_product
-- ----------------------------
BEGIN;
INSERT INTO `qianli_product` VALUES (1, 1, '过氧化氢灭菌机器人', 'Cubic 1000', 'CUBIC 1000过氧化氢灭菌机器人采用最新的压缩喷雾技术，实现过氧化氢干雾粒子小于2μm，对空气和物体表面进行灭菌。\nCUBIC 1000过氧化氢灭菌机器人主要分为三部分：一、采用工业级AGV机器人底盘，利用激光雷达导航系统，精确定位，利用深度摄像头、超声波传感器等做到精确避障，到达指定位置；二、上位机控制移动、行走、地图建立、权限管理等工作；三、由西门子PLC控制的消毒模块，包含气源动力、过滤单元、消毒剂给药单元、多风道喷嘴。\n采用压缩喷雾技术,将蠕动泵定量抽取的消毒剂输送至喷嘴处；同时设备内置空气压缩机将高速气流输送喷嘴的环形风道、以及3处孔型风道处；当调节好的消毒剂液体遇到高速压缩气体，会瞬间将消毒剂液体碰撞粉碎成粒径2μm的干雾颗粒，并随着高速气体喷洒至待灭菌空间中，干雾状过氧化氢粒子会在空气中悬浮、并且相互碰撞，利用“布朗运动”效应，均匀扩散，从而对空气及物体表面进行灭菌。设备内置软件算法将灭菌所需流量与压缩气体的量按照比例进行测算，保证安全的基础上，达到最佳消毒灭菌效果。\n', '/upload/2022071411145562cf8a2fef8e5.mp4');
INSERT INTO `qianli_product` VALUES (2, 1, '悬浮粒子采样机器人', 'P1', 'P-ONE 机器人在制药行业的主要应用目的是采用智能化方式提高采空气采样准确度，应对不同洁净级别检测任务，执行不同采样工作，降低人为干扰因素，提高检测效率。\nP-ONE 机器人作为手术室内环境监测的智能助手，对手术之前室内的颗粒物数量进行检测，为手术前环境做出环境评估。\nP-ONE 机器人在电子类产品制造车间，为为尘车间提供环境巡检，对车间洁净程度和车间安全提供保障。\n', NULL);
INSERT INTO `qianli_product` VALUES (3, 1, '浮游菌采样机器人', 'MIC20', 'Mic 20 浮游菌采样器是一款高性能浮游菌采样机器人，基于机器人自动行走的前提，内置一套浮游菌采样器，基于andersen撞击原理设计，机器人内部配有可自动完成培养皿安装、开盖、加盖、存储等自动化操作模块，机器人及采样系统按照要求自动行走至指定区域、位置内进行定时、定量采样；同时记录相关采样数据、采样位置信息。大大降低了人员成本、及采样的准确度。\n', NULL);
INSERT INTO `qianli_product` VALUES (4, 2, '固定式过氧化氢灭菌器', 'FHP500', '采用压缩喷雾技术,将蠕动泵定量抽取的消毒剂输送至喷嘴处；同时设备内置空气压缩机将高速气流输送喷嘴的环形风道、以及3处孔型风道处；当调节好的消毒剂遇到高速压缩气体，会瞬间将消毒剂液体碰撞粉碎成粒径0.2微米的干雾颗粒，并随着高速气体喷洒至带灭菌空间中，干雾状过氧化氢粒子会在空气中悬浮、并且相互碰撞，利用布朗运动效应，均匀扩散，从而对空气及物体表面进行灭菌。设备内置软件算法将灭菌所需流量与压缩气体的量按照比例进行测算，达到最佳消毒灭菌效果。\n', NULL);
INSERT INTO `qianli_product` VALUES (5, 2, '便携式过氧化氢消毒机', 'FHP200', '采用压缩喷雾技术,将蠕动泵定量抽取的消毒剂输送至喷嘴处；同时设备内置空气压缩机将高速气流输送喷嘴的环形风道、以及3处孔型风道处；当调节好的消毒剂遇到高速压缩气体，会瞬间将消毒剂液体碰撞粉碎成粒径0.2um的干雾颗粒，并随着高速气体喷洒至带灭菌空间中，干雾状过氧化氢粒子会在空气中悬浮、并且相互碰撞，利用布朗运动效应，均匀扩散，从而对空气及物体表面进行灭菌。设备内置软件算法将灭菌所需流量与压缩气体的量按照比例进行测算，达到最佳消毒灭菌效果。\n', NULL);
INSERT INTO `qianli_product` VALUES (6, 2, '车载式过氧化氢消毒机', 'FHP100', '内置充电锂电池供电，设备采用压缩喷雾技术,将蠕动泵定量抽取的消毒剂输送至喷嘴处；同时设备内置空气压缩机将高速气流输送喷嘴的环形风道、以及3处孔型风道处；当调节好的消毒剂遇到高速压缩气体，会瞬间将消毒剂液体碰撞粉碎成粒径0.2um的干雾颗粒，并随着高速气体喷洒至带灭菌空间中，干雾状过氧化氢粒子会在空气中悬浮、并且相互碰撞，利用布朗运动效应，均匀扩散，从而对空气及物体表面进行灭菌。设备内置软件算法将灭菌所需流量与压缩气体的量按照比例进行测算，达到最佳消毒灭菌效果。\n', NULL);
INSERT INTO `qianli_product` VALUES (7, 2, '管路式灭菌器', 'ER-D系列', 'ER-D系列管道式过氧化氢灭菌器采用低浓度（≤7.5%）过氧化氢灭菌器，利用主机中配置压缩空气及蠕动泵，将灭菌剂及洁净的压缩气体，输送至所需要灭菌的区域干雾喷嘴处，产生的小于5微米粒径级别的过氧化氢干雾粒子，粒子之间进行相互碰撞，利用“布朗运动”的运动学原理，使得干雾过氧化氢均匀分布，对物体表面及空气进行高水平灭菌。\nER-D系列产品，适用于净化房间较多、空间较大，结构复杂的制药生产车间，同时为用户实施“量身定制”方案。\nER-D系列产品设计符合药品生产GMP中软硬要求，对过氧化氢灭菌具有典型抗力的嗜热脂肪芽孢杆菌生物指示剂（ATCC12980）达到6-log的杀灭效果，同时对较难杀灭的霉菌、孢子类真菌有较强的杀灭水平。\n', NULL);
INSERT INTO `qianli_product` VALUES (8, 2, '脉冲强光灭菌器', 'S1', '千立脉冲强光灭菌器采用新型全光谱冷光杀菌技术，以脉冲形式激发强烈的白光，光谱分布近似太阳光，强度相当于到达地球表面太阳光强度大数万倍，它利用瞬时、高强度大脉冲光能量消灭空气、物表中的细菌和微生物。\n', NULL);
INSERT INTO `qianli_product` VALUES (9, 3, '安瓿瓶开启器', 'APM-3', '日常手动开启安瓿瓶存在较大的问题，主要为：滑落、滑伤手套、玻璃碎屑较多。\nAPM-3安瓿瓶开启器，主要解决在开启较多安瓿瓶水针过程中的人员防护问题，同时快速开启同一规格尺寸的安瓿瓶，降低碎瓶率、降低手动开启过程中玻璃残渣。\n', NULL);
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
