import { LayoutService } from '@/layout/layout.service'
import { Injectable } from '@nestjs/common'

@Injectable()
export class PostService {
  constructor(private layoutService: LayoutService) {}

  data() {
    return {
      layout: this.layoutService.layout(),
      post: {
        category: '资讯动态',
        date: '2022-07-06',
        title: '千立生物过氧化氢消毒机可以有效消灭病毒传播',
        img: '/upload/20220706142811159423.jpeg'
      }
    }
  }

  all() {
    return [
      {
        category: '资讯动态',
        date: '2022-07-06',
        link: '/post/1',
        title: '千立生物过氧化氢消毒器为发热病人转运车辆消毒提供解决方案',
        desc: '为了有效控制疫情，近日国家卫生计生委关于印发《突发事件卫生应急预案管理办法》的通知，重点关注度医院、核酸检测等防疫站点情况，对于常态化的疫情防控上，各类场景均有可能存在交叉感染的可能性，在发热病人的急救车转运后，如何对车辆进行消毒等分别给出了明确的相关指导意见。',
        img: '/upload/20220706142121500915.jpeg'
      },
      {
        category: '资讯动态',
        date: '2022-07-06',
        link: '/post/1',
        title: '千立生物过氧化氢消毒机可以有效消灭病毒传播',
        desc: '0月初在青岛胸科医院CT室内的交叉污染，给我们又上了一课，院内感染，直接威胁到患者、医护人员的身体健康，让全国民众逐渐放松的心情再次紧绷起来。国家卫建委发布《新型冠状病毒感染的肺炎的诊疗方案（试行第八版）》中，CT影像结果为"临床诊断病例"的判定依据CT检查室环境特点',
        img: '/upload/20220706142811159423.jpeg'
      },
      {
        category: '资讯动态',
        date: '2022-05-06',
        link: '/post/2',
        title: '千立生物过氧化氢消毒机智能化解决发热门诊空气物表消毒问题',
        desc: '日前，国家建科委在其官网上发布《关于完善发热门诊和医疗机构感染控制工作的通知》（以下简称《通知》）。《通知》指出，目前，我国新冠肺炎疫情基本得到有效控制，疫情防控阻击战取得重大战略成果。为进一步巩固防控成果，全面落实“及时发现、快速处置、精准管控、有效救治”的目标要求，坚持在疫情防控工作中补短板、堵漏洞、强弱项，将发热门诊和医院感染防控工作常抓不懈，故印发《通知》。《通知》对进一步做好发热门诊、医疗机构感染防控等相关医疗工作提出了具体要求',
        img: '/upload/20220706142531985504.jpeg'
      }
    ]
  }
}
